; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-26)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room5)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
)
)
)

; plan
1. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 3 of 26
2. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 3 of 26
3. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 4 of 26
4. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 4 of 26
5. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 4 of 26
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 4 of 26
7. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 5 of 26
8. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 5 of 26
9. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 5 of 26
10. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 5 of 26
11. (drop ball8 room4 left)
   deleted: (carry ball8 left)
   added: (at ball8 room4) (free left)
   goals met: 6 of 26
12. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 6 of 26
13. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 6 of 26
14. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 6 of 26
15. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 6 of 26
16. (drop ball10 room4 left)
   deleted: (carry ball10 left)
   added: (at ball10 room4) (free left)
   goals met: 7 of 26
17. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 7 of 26
18. (pick ball26 room5 left)
   deleted: (at ball26 room5) (free left)
   added: (carry ball26 left)
   goals met: 7 of 26
19. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 7 of 26
20. (drop ball26 room4 left)
   deleted: (carry ball26 left)
   added: (at ball26 room4) (free left)
   goals met: 8 of 26
21. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 8 of 26
22. (pick ball25 room5 left)
   deleted: (at ball25 room5) (free left)
   added: (carry ball25 left)
   goals met: 8 of 26
23. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 8 of 26
24. (drop ball25 room4 left)
   deleted: (carry ball25 left)
   added: (at ball25 room4) (free left)
   goals met: 9 of 26
25. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 9 of 26
26. (pick ball24 room5 left)
   deleted: (at ball24 room5) (free left)
   added: (carry ball24 left)
   goals met: 9 of 26
27. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 9 of 26
28. (drop ball24 room4 left)
   deleted: (carry ball24 left)
   added: (at ball24 room4) (free left)
   goals met: 10 of 26
29. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 10 of 26
30. (pick ball23 room5 left)
   deleted: (at ball23 room5) (free left)
   added: (carry ball23 left)
   goals met: 10 of 26
31. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 10 of 26
32. (drop ball23 room4 left)
   deleted: (carry ball23 left)
   added: (at ball23 room4) (free left)
   goals met: 11 of 26
33. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 11 of 26
34. (pick ball22 room5 left)
   deleted: (at ball22 room5) (free left)
   added: (carry ball22 left)
   goals met: 11 of 26
35. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 11 of 26
36. (drop ball22 room4 left)
   deleted: (carry ball22 left)
   added: (at ball22 room4) (free left)
   goals met: 12 of 26
37. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 12 of 26
38. (pick ball21 room5 left)
   deleted: (at ball21 room5) (free left)
   added: (carry ball21 left)
   goals met: 12 of 26
39. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 12 of 26
40. (drop ball21 room4 left)
   deleted: (carry ball21 left)
   added: (at ball21 room4) (free left)
   goals met: 13 of 26
41. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 13 of 26
42. (pick ball20 room5 left)
   deleted: (at ball20 room5) (free left)
   added: (carry ball20 left)
   goals met: 13 of 26
43. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 13 of 26
44. (drop ball20 room4 left)
   deleted: (carry ball20 left)
   added: (at ball20 room4) (free left)
   goals met: 14 of 26
45. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 14 of 26
46. (pick ball19 room5 left)
   deleted: (at ball19 room5) (free left)
   added: (carry ball19 left)
   goals met: 14 of 26
47. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 14 of 26
48. (drop ball19 room4 left)
   deleted: (carry ball19 left)
   added: (at ball19 room4) (free left)
   goals met: 15 of 26
49. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 15 of 26
50. (pick ball15 room3 left)
   deleted: (at ball15 room3) (free left)
   added: (carry ball15 left)
   goals met: 15 of 26
51. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 15 of 26
52. (drop ball15 room4 left)
   deleted: (carry ball15 left)
   added: (at ball15 room4) (free left)
   goals met: 16 of 26
53. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 16 of 26
54. (pick ball14 room3 left)
   deleted: (at ball14 room3) (free left)
   added: (carry ball14 left)
   goals met: 16 of 26
55. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 16 of 26
56. (drop ball14 room4 left)
   deleted: (carry ball14 left)
   added: (at ball14 room4) (free left)
   goals met: 17 of 26
57. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 17 of 26
58. (pick ball13 room3 left)
   deleted: (at ball13 room3) (free left)
   added: (carry ball13 left)
   goals met: 17 of 26
59. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 17 of 26
60. (drop ball13 room4 left)
   deleted: (carry ball13 left)
   added: (at ball13 room4) (free left)
   goals met: 18 of 26
61. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 18 of 26
62. (pick ball12 room3 left)
   deleted: (at ball12 room3) (free left)
   added: (carry ball12 left)
   goals met: 18 of 26
63. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 18 of 26
64. (drop ball12 room4 left)
   deleted: (carry ball12 left)
   added: (at ball12 room4) (free left)
   goals met: 19 of 26
65. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 19 of 26
66. (pick ball11 room3 left)
   deleted: (at ball11 room3) (free left)
   added: (carry ball11 left)
   goals met: 19 of 26
67. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 19 of 26
68. (drop ball11 room4 left)
   deleted: (carry ball11 left)
   added: (at ball11 room4) (free left)
   goals met: 20 of 26
69. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 20 of 26
70. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 20 of 26
71. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 20 of 26
72. (drop ball6 room4 left)
   deleted: (carry ball6 left)
   added: (at ball6 room4) (free left)
   goals met: 21 of 26
73. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 21 of 26
74. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 21 of 26
75. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 21 of 26
76. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 22 of 26
77. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 22 of 26
78. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 22 of 26
79. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 22 of 26
80. (drop ball4 room4 left)
   deleted: (carry ball4 left)
   added: (at ball4 room4) (free left)
   goals met: 23 of 26
81. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 23 of 26
82. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 23 of 26
83. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 23 of 26
84. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 24 of 26
85. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 24 of 26
86. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 24 of 26
87. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 24 of 26
88. (drop ball2 room4 left)
   deleted: (carry ball2 left)
   added: (at ball2 room4) (free left)
   goals met: 25 of 26
89. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 25 of 26
90. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 25 of 26
91. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 25 of 26
92. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 26 of 26
